tutorials/wavemakerTank/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
   (0.0       0.0       0.0)
   (5.0       0.0       0.0)
   (0.0       5.0       0.0)
   (5.0       5.0       0.0)
   (0.0       0.0       0.4)
   (5.0       0.0       0.4)
   (0.0       5.0       0.4)
   (5.0       5.0       0.4)
   (0.0       0.0       0.7)
   (5.0       0.0       0.7)
   (0.0       5.0       0.7)
   (5.0       5.0       0.7)
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (100 100 11) simpleGrading (1.0 1.0 0.5)
    hex (4 5 7 6 8 9 11 10) (100 100 8) simpleGrading (1.0 1.0 2.0)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 6 2)
            (4 8 10 6)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 3 7 5)
            (5 7 11 9)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 2 3 1)
        );
    }
    wall1
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (4 5 9 8)
        );
    }
    wall2
    {
        type wall;
        faces
        (
            (2 6 7 3)
            (6 10 11 7)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (8 9 11 10)
        );
    }
);

mergePatchPairs
(
);

